&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
    ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;
    Если ТекущаяСтрока <> Неопределено Тогда
        Если ТекущаяСтрока.Оклад <> Неопределено И ТекущаяСтрока.КоличествоДней <> Неопределено Тогда
            ТекущаяСтрока.ИтоговаяСумма = ТекущаяСтрока.Оклад * ТекущаяСтрока.КоличествоДней;
        Иначе
            ТекущаяСтрока.ИтоговаяСумма = 0;
        КонецЕсли;
        ОбновитьИтогоНаСервере();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогоНаСервере()
    Итого = 0;
    Для Каждого Строка Из Объект.Сотрудники Цикл
        Итого = Итого + Строка.ИтоговаяСумма;
    КонецЦикла;
    ИтогоПоДокументу = Итого;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриУдалении(Элемент)
    ОбновитьИтогоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОкладПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиКоличествоДнейПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
